app/controllers/short_links_controller.rb

  def index
    @short_link = ShortLink.new
    @top_short_links = ShortLink.order(updated_at: :desc)
---
SELECT "short_links".* FROM "short_links"   ORDER BY "short_links"."updated_at" DESC

  def show
    if params[:short_url]
      @short_link = ShortLink.find_by(short_url: params[:short_url])
      if redirect_to @short_link.base_url
        @short_link.increment!(:no_of_clicks)
        statistic = @short_link.short_address.find_or_initialize_by(ip_address: request.remote_ip)
        if statistic.new_record?
          statistic.save!
        else
          statistic.increment!(:no_of_clicks)
        end
      end
    else
      @short_link = ShortLink.find(params[:id])
---
SELECT  "short_links".* FROM "short_links"  WHERE "short_links"."short_url" = '4m1mgnrg' LIMIT 1
UPDATE "short_links" SET "no_of_clicks" = $1, "updated_at" = $2 WHERE "short_links"."id" = 6  [["no_of_clicks", 1], ["updated_at", "2015-10-05 17:36:06.743337"]]
SELECT  "short_addresses".* FROM "short_addresses"  WHERE "short_addresses"."short_link_id" = $1 AND "short_addresses"."ip_address" = '127.0.0.1' LIMIT 1  [["short_link_id", 28]]
UPDATE "short_addresses" SET "no_of_clicks" = $1, "updated_at" = $2 WHERE "short_addresses"."id" = 1  [["no_of_clicks", 1], ["updated_at", "2015-10-05 18:02:53.693250"]]
SELECT  "short_links".* FROM "short_links"  WHERE "short_links"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @short_link = ShortLink.new(short_link_params)

    respond_to do |format|
      if @short_link.save
---
INSERT INTO "short_links" ("base_url", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["base_url", "https://rhomobile.com"], ["created_at", "2015-10-05 16:15:39.030208"], ["updated_at", "2015-10-05 16:15:39.030208"]]

  def update
    respond_to do |format|
      if @short_link.update(short_link_params)
---
UPDATE "short_links" SET "base_url" = $1, "updated_at" = $2 WHERE "short_links"."id" = 23  [["base_url", "rhomobile"], ["updated_at", "2015-10-05 17:21:37.175601"]]

  def set_short_link
    @short_link = ShortLink.find(params[:id])
---
SELECT  "short_links".* FROM "short_links"  WHERE "short_links"."id" = $1 LIMIT 1  [["id", 28]]